Tarea1/Difusor_bidimensional/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// epsilon = Cmu^0.75 * k^1.5 / L, con L = 0.07*Dh (Dh = 2*H1 = 0.2 m)
dimensions      [turbulentEpsilon];

internalField   uniform 0.328;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.328;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            epsilonWallFunction;
        value           uniform 0.328;
    }
    lowerWall
    {
        type            epsilonWallFunction;
        value           uniform 0.328;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
