Tarea1/Difusor_bidimensional/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// k = 1.5*(U*I)^2, con U = 5 m/s e intensidad turbulenta I = 5%
dimensions      [turbulentKineticEnergy];

internalField   uniform 0.0938;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0938;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            kqRWallFunction;
        value           uniform 0.0938;
    }
    lowerWall
    {
        type            kqRWallFunction;
        value           uniform 0.0938;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
