Tarea1/Difusor_bidimensional/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Difusor bidimensional: tramo recto de entrada + expansion + tramo recto
// de salida. Dominio 2D resuelto en el plano x-y (espesor unitario en z).

// Geometria
H1      0.1;    // altura del canal de entrada [m]
H2      0.3;    // altura del canal de salida  [m]
L1      0.2;    // longitud tramo recto de entrada [m]
L2      0.6;    // longitud tramo del difusor (expansion) [m]
L3      0.3;    // longitud tramo recto de salida [m]
zBack   0.01;   // espesor en z (caso 2D) [m]

x0      0;
x1      $L1;
x2      #calc "$L1 + $L2";
x3      #calc "$L1 + $L2 + $L3";

y0      0;
y1      $H1;
y2      $H2;

z0      0;
z1      $zBack;

// Discretizacion
nx1     20;     // celdas tramo de entrada
nx2     60;     // celdas tramo del difusor
nx3     30;     // celdas tramo de salida
ny      40;     // celdas en altura (comun a los 3 bloques)
nz      1;      // celdas en z (caso 2D)

// Refinamiento hacia ambas paredes (superior e inferior)
yGrading simpleGrading (1 ((0.5 0.5 4)(0.5 0.5 0.25)) 1);

vertices
(
    ($x0 $y0 $z0)   // 0
    ($x0 $y0 $z1)   // 1
    ($x0 $y1 $z0)   // 2
    ($x0 $y1 $z1)   // 3

    ($x1 $y0 $z0)   // 4
    ($x1 $y0 $z1)   // 5
    ($x1 $y1 $z0)   // 6
    ($x1 $y1 $z1)   // 7

    ($x2 $y0 $z0)   // 8
    ($x2 $y0 $z1)   // 9
    ($x2 $y2 $z0)   // 10
    ($x2 $y2 $z1)   // 11

    ($x3 $y0 $z0)   // 12
    ($x3 $y0 $z1)   // 13
    ($x3 $y2 $z0)   // 14
    ($x3 $y2 $z1)   // 15
);

blocks
(
    hex (0 4 6 2 1 5 7 3)      ($nx1 $ny $nz) $yGrading
    hex (4 8 10 6 5 9 11 7)    ($nx2 $ny $nz) $yGrading
    hex (8 12 14 10 9 13 15 11) ($nx3 $ny $nz) $yGrading
);

edges
(
);

boundary
(
    inlet
    {
        type    patch;
        faces
        (
            (0 2 3 1)
        );
    }

    outlet
    {
        type    patch;
        faces
        (
            (12 13 15 14)
        );
    }

    lowerWall
    {
        type    wall;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
        );
    }

    upperWall
    {
        type    wall;
        faces
        (
            (2 6 7 3)
            (6 10 11 7)
            (10 14 15 11)
        );
    }

    frontAndBack
    {
        type    empty;
        faces
        (
            (0 4 6 2)
            (4 8 10 6)
            (8 12 14 10)
            (1 3 7 5)
            (5 7 11 9)
            (9 11 15 13)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
